{
  "sections": [
    {
      "title": "STUDENTS’ CONDUCT AND DISCIPLINE",
      "subtitle": "Expected student behavior on campus",
      "content": "The University is established primarily for the development of students intellectually, socially and culturally. It also aims at inculcating good character as an integral part of the education. An acceptance of admission offer by a student into the University, automatically implies that he or she has accepted to abide by the Rules and Regulations that may from time to time be made for the governance of the University. Such acceptance also carries with it an obligation that the student shall conduct himself or herself as a law-abiding and responsible member of the academic community in accordance with the University’s best standards, rules and other conditions established by the legally constituted authorities of the University.\n"
    },
    {
      "title": "PERSONAL AND ACADEMIC INTEGRITY",
      "subtitle": "Be honest and responsible in all activities",
      "content": "It is hereby generally recognized that dishonesty of any kind is a behavioural issue which must be unlearned. Therefore, beyond any punitive measures as may be prescribed by this regulations and/or other relevant provisions of the University’s Act and other Laws of the Federation of the Federal Republic of Nigeria against any act of dishonesty of any kind, the following are the minimum standard of personal and academic integrity to be strictly and consistently observed by all students;\nBe honest and conduct himself/herself in an ethical manner in the pursuit of his/her studies.\nAttend all his/her lectures punctually.\nNotify his/her lecturer(s) in good time, and preferably, in writing, if he/she must be away from a lecture/laboratory or class function or examination.\nMaintain high degree of orderliness and decorum in the class.\nHonestly complete and submit his/her assignments as at when due.\nCite references honestly on assignments.\nRespect ethical standards of the Library in carrying out assignments/research.\nCooperate, if called upon, in the investigation of any allegation of dishonesty pertaining to another student.\nTake pride in upholding the ethical standards of this University through his/her words, writing, attitude, and behaviour.\nRegard other members of the community as part of a family and as such live harmoniously and maintain a respectful relationship with them in the classrooms, hostels, offices, etc.\nConduct himself/herself in such a way that his/her priority is to live a wholesome life devoid of anti-social activities especially cultism. Membership of a cult does not help a student, rather it could lead to his/her sudden death from fellow cult members or termination of his/her studies through suspension or expulsion. A good, positive and forward-looking behaviour at all times coupled with good company should be his/her priority. Avoid anybody who makes overture to him/her to join any unregistered group/association by Student Affairs Office.\nMaintain good personal hygiene. Hostel rooms should be as clean as possible as poor environmental sanitation can lead to outbreak of dysentery, cholera, typhoid, tuberculosis, etc.\nEvery student (male or female) must dress decently, as the mode of dressing is a reflection of individual character and personality. Every student must avoid any dress that may expose sensitive and vital areas of their bodies. No student shall be involved in pornography either within or outside the University. Violation of the Dress Code as prescribed by the University or involvement in pornography is a serious act of misconduct which shall attract stiff penalty.\nBe wary of promiscuous living and unprotected sex. The ravaging spread of HIV/AIDS all over the world is a warning to all students. AIDS certainly kills and students should do everything possible to avoid any action that will make him/her a victim of this scourge or spread the disease to others.\nEvery student of the University is required to maintain a high standard of integrity. The University regards as serious offences any act of unethical, immoral, dishonest, disloyal or destructive behaviour as well as acts which violate University regulations. It is the responsibility of each student not only to acquaint himself/herself with these Rules and Regulations, but also to uphold them at all times since the University degree is awarded to persons found worthy both in learning and character.\n"
    },
    {
      "title": "DISCIPLINARY RULES",
      "subtitle": "Actions that are not allowed at the university",
      "content": "The rules of discipline require that a student shall:\nNot engage in any form of activity, alone or with any other person or group, which interferes with, restricts, hinders, or adversely affects the objectives of the University, which are set out in the Act of the University.\nNot engage in any form of activity, whether alone or with any other person or group, which interferes with, restricts, hinders, or adversely affects the rights of any person duly authorized and lawfully present on University premises to express any view of any subject peacefully or which prevents any person duly authorized from entering, passing through, or leaving the University premises for such purposes.\nNot engage in any form of activity which interferes with, restricts, hinders, disrupts, or adversely affects the following activities on University premises of any person or persons duly authorized and lawfully present:\nTeaching of any kind\nResearch of any kind\nStudy of any kind (whether private, verbal, written, mechanical or electronic)\nLearning of any kind (whether private, verbal, written, mechanical or electronic)\nThe conduct of the business of the Council or the Senate of the University\nAdministration of any part of the University’s affairs or business\nExecution of the official and public duties or work of the University\nWork and duties of any employee or member of the University\nSpeaking by authorized visitors to the University\nAny combination of (i) to (ix) above\nNot steal, destroy, damage, deface, or vandalize or take unauthorized possession of University property.\nNot treat as his/her own possession, property of the University or of any other member of the University.\nObey all lawful instructions concerning any business of the University, whether verbal or written.\nNot simulate, forge, falsify, misuse, alter, damage or destroy any record or document (whether written, printed, magnetic, electronic, photographic or in any other form) of the University so that any false record is created or any misrepresentation made.\nNot impersonate any officer or employee of the University.\nNot engage in any dishonest, false, or other misleading representation or activity which affects academic assessments or examinations and to obey all examination regulations.\n"
    },
    {
      "title": "SANCTIONS FOR VIOLATION OF REGULATIONS",
      "subtitle": "Penalties for breaking university rules",
      "content": "The following are some of the sanctions which may be imposed for violation of University regulations or Code of Conduct:\nFines\nThe Dean and Hall Masters/Mistresses may impose a minimum fine of ₦5,000.00 for certain categories of offences committed in the Halls of Residence. Offences committed in other locations of the University which attracts fines will be dealt with by the appropriate authority. These must be paid within specified periods to avoid further stringent actions being imposed.\nRestitution\nRestitution means that a student must pay for damage done to, loss or misappropriation of University property or the property of other members of the University community.\nSuch restitution is imposed on any student who alone, or through group concerted activities, organizes or participates in events which cause damage or loss.\nReprimand and Warning\nA student may be reprimanded and warned for violation of University rules and regulations.\nIf he/she were to commit further breaches of discipline in future, his/her present offence would be taken into consideration in the course of future hearings when a penalty for that subsequent breach is under consideration.\nSuspension/Rustication\nAny student suspended or rusticated must withdraw from the University for the stated period and shall further comply with any other condition(s) or requirement(s) related to the suspension/rustication.\nExpulsion\nAny student expelled ceases to be a member of the University and loses all rights and privileges of membership. It may also require the payment of compensation in some cases.\nAll cases of expulsion and suspension/rustication will be duly and promptly communicated to all organs of the University, the student concerned, and his/her parents/guardians.\nThe name(s) of the student(s) will also be published in national dailies and on the University website. Other universities in Nigeria will also be notified.\nAPPEAL\nIn all disciplinary cases, the student concerned has a right to appeal to the Council through his/her Head of Department, the Dean of his/her Faculty, and the Vice-Chancellor against the decision of the Disciplinary Committee or any other person—within 48 days of the receipt of the disciplinary decision.\n"
    },
    {
      "title": "GUIDELINES FOR ACCEPTABLE BEHAVIOUR",
      "subtitle": "How to interact respectfully with others",
      "content": "Any student who displays any form of disrespect bordering on contempt to any official of the University while the latter is performing his/her official assignment shall be disciplined for an act of misconduct.\nWriting of an insulting letter to an official of the University shall constitute an act of misconduct.\nNo student or group of students shall by-pass the official line of communication while writing to the University Administration. The approved line of communication is through the appropriate Head of Department and the Dean of Faculty. All student grievances (other than academic matters) should be routed through the Dean of Student Affairs to the appropriate arm of the University. Also, correspondence from the Students' Union to the University Administration must be duly signed by both the President and the Secretary of the Students' Union.\nStudents are not allowed to make communication with outside agencies, governments, or national/international organizations for the purpose of soliciting financial sponsorship/aid that may jeopardize the interest of the University.\nUnlawful possession of all types of dangerous weapons or firearms — e.g. guns, cutlasses, knives, grenades, acids, etc. — is strictly prohibited.\n"
    },
    {
      "title": "ORIENTATION OF FRESH STUDENTS",
      "subtitle": "Introductory activities for new students",
      "content": "Orientation Activities\nThe orientation of new students to the University usually takes place during the week of resumption for the session. The Student Affairs Unit, in co-operation with other departments/units, organizes the orientation programme. The programme is intended to enable new students to settle down and adjust to University academic, social, and cultural environments.\n\nOrientation also affords students an opportunity to familiarize themselves with the rules, regulations, and procedures of the University. Since ignorance is no defence, the activities offer the students a singular opportunity to avoid unnecessary embarrassment.\n\nAs part of the orientation week activities, newly admitted students are able to meet the Registrar, Dean of Student Affairs, Deans of Faculties, Heads of Departments and Senior Administrative Officers. They are introduced to various facilities in the University such as the Library, the Medical Services, Counselling Services, Sports, Campus Transportation, etc.\nPenalty for Not Attending Orientation Activities\nIt is mandatory for ALL newly admitted students to attend ALL the orientation activities and sign the attendance register. Any student who has received a letter of provisional admission before the Orientation Week but fails to attend any of the orientation week activities may have his/her admission withdrawn.\n"
    },
    {
      "title": "REGISTRATION OF STUDENTS",
      "subtitle": "Steps to register as a student",
      "content": "On arrival on the campus, newly admitted students are required to collect registration kits from the Academic Office. All the forms contained in the kit are to be completed in consultation with the Records Officer and the Faculty Officer or Level Adviser. Similarly, the personal data form issued by the Student Affairs Unit must be completed by all students and returned to the Unit.\n"
    },
    {
      "title": "MATRICULATION, MATRICULATION NUMBERS AND IDENTITY CARD",
      "subtitle": "About admission, ID cards, and their use",
      "content": "Matriculation\nOnly candidates who have satisfied the minimum educational requirements of the University of Ilorin are offered final admission and then matriculated as students of the University. On the Matriculation day, each fresh student swears to the Matriculation Oath which shall be produced by the University. Violation of the matriculation oath is a very serious offence which could lead to the expulsion of a student.\nUse of Matriculation Number\nEach student is assigned a Matriculation Number upon registration. No official student paper or document is regarded as complete or valid unless it carries the correct matriculation number.\nIdentity Cards\nEach matriculated student of the University is issued an official student Identity Card, valid for the period indicated on the card, and which should be renewed appropriately. The Identity Card must be worn on the neck on campus at all times. Students may be required, at any time, to identify themselves upon request by authorized University officials, acting in the performance of their duties. Some University facilities are open only to students who are able to show valid identity cards. Students are required, therefore, to always wear their identity card on their neck at all times. For instance, no student will be admitted to the Library, Lecture rooms, examination venues, Laboratories, Halls of Residence, etc., without the identity card. The cost of each identity card is determined by the University from time to time.\nLoss of Identity Card: A student who loses his/her Identity Card must report the loss to the Deputy Registrar (Academic) through his/her Faculty Officer as soon as possible. A new card will be issued on payment of a sum which will be determined by the University from time to time.\nSubmission of Identity Card: A student leaving the University, either on completion or before completion of his/her course, must return the Identity Card to the Deputy Registrar (Academic) through his/her Faculty Officer or any other authorized person(s) as the case may be.\nMisuse of Identity Card: It is an offence for students to misuse their own Identity Card or that of other students, either by way of transfer or impersonation.\nSuch misuse shall constitute misconduct liable to disciplinary action.\nInstruction on Presentation of Names\nStudents are required to present their names in the following approved style: surname first in capitals, then other names.\nExample: AFUYE, Moses Olarinde\n"
    },
    {
      "title": "REGULATIONS GOVERNING THE CONDUCT OF UNIVERSITY EXAMINATIONS",
      "subtitle": "Exam rules and consequences for cheating",
      "content": "(A) Eligibility\nAll students who are duly registered for courses in a given semester are eligible to sit for examinations in those courses, except students in the following categories:\nA student who absents himself/herself from the University for upward of six weeks in any semester without official permission shall be deemed to have withdrawn from the University.\nA student who fails to attend up to 75% of practical/lecture hours.\n(B) Instructions to Candidates\nStudents shall always ensure that they acquaint themselves with the examination regulations and instructions to candidates.\nCandidates shall attend punctually at the time scheduled for their papers. Candidates arriving more than half an hour after the examination has started shall be admitted only at the discretion of the Chief Invigilator.\nCandidates shall bring with them to the examination hall their own ink, pens, rulers, erasers, and pencils, and any other materials which are permitted by regulations.\nCandidates are warned to not bring lecture notes, textbooks, jotters, bags, mobile phones, or other prohibited items into the exam hall. The University will not take responsibility for the loss of mobile phones.\nTo ensure orderliness in the examination hall, seats shall be arranged according to the number of groups taking examinations at each particular time. Candidates shall not enter the hall until their identity cards and other documents have been checked.\nCommunication of any kind during the exam is strictly prohibited. Any candidate found giving or receiving irregular assistance commits misconduct and will face disciplinary action.\nSilence must be maintained. The only acceptable way to get the attention of the invigilator is by raising a hand.\nThe use of scrap paper is prohibited. All rough work must be done in the answer booklet and crossed out neatly. Supplementary answer sheets (if needed) will not be supplied until 30 minutes after the exam begins. These must be tied into the main answer booklet even if they contain only rough work.\nCandidates taking Mathematics, Engineering Drawing, or similar courses must bring their own instruments (compasses, dividers, protractors, diagonal scales, set squares).\nPersonal copies of Mathematical Tables are not allowed in the examination hall.\nBefore handing in their scripts at the end of the examination, candidates shall satisfy themselves that they have inserted at the appropriate place their matriculation numbers and the numbers of the questions answered. Except for the question paper and any other materials they may have legitimately brought with them (as indicated in rules Biii) and (viii) above), candidates shall not be allowed to remove or mutilate any paper or material supplied by the University.\nCandidates shall use their matriculation numbers for examinations. (Candidates who are in doubt of their correct matriculation numbers are advised to confirm from the Senate and Examinations Office).\nStudents shall remain seated while invigilators collect scripts row by row.\nCandidates must write their names, matriculation numbers, department, and sign on the attendance sheet.\nStudents intending to use calculators in any University examination should observe the following regulations:\nCandidates shall be permitted the use of electronic calculators except programmable ones, Ignorance as to whether a calculator is Programmable or not will not be acceptable;\nThe Calculator must be small (hand-held) battery / solar operated, and mobile phone is not allowed;\nA candidate shall not borrow another Candidate’s calculator during the examination as this practice shall be construed as giving or receiving irregular assistance during the examination; —\nInstruction manuals are prohibited (as these often contain useful mathematical formulae and methods);\nOn entry into the examination venue, the calculator shall be switched off and its memory be made blank;\nOnly one calculator per student is allowed;\nCandidates shall make available for inspection by invigilators, their calculators on entry into the examination hall and at any time during the examination; and\nA contravention of any of these regulations shall be treated as examination misconduct.\n(C) Examination Code of Conduct, Offences and Penalty\nCode of Conduct:\nCandidates shall:\nuse or consult, during an examination only such books, paper, instruments or other materials or aids as are specifically permitted or provided by the University.\nnot introduce or attempt to introduce into examination venue hand bags, books, notes, mobile phone, instruments or other materials or aids that are not permitted;\nnot enter any examination venue with any inscriptions on any part of the body e.g. palm, arm, thigh, etc. and/or any material if such inscriptions bear any relevance to the examination;\nnot pass or attempt to pass any information from one person to another during an examination;\nneither act in collusion with any other candidate(s) or person(s) not copy nor attempt to copy from another candidate, nor engage in any similar activity;\nnot disturb or distract any other candidate(s) during the examination;\nnot be allowed to leave an examination venue until after 75% of the time allocated for that particular paper has expired;\nnot use other people to sit for any University Examination on their behalf;\nnot smoke in the examination hall; and\nnot to be in possession of incriminating material(s) either used or not at the examination or involved in any other serious examination misconduct including impersonation before, during or after an examination.\nIn the case of CBT examinations, candidates must be orderly and abide by the rules or guidelines prevailing at the centre.\nFailure to observe any of the rules (a) to (k) above, shall prima facie, constitute examination misconduct.\nProcedure for investigating alleged Examination Misconduct\nAt the discretion of the Chief Invigilator, a candidate may be required to leave the examination venue when his/her conduct is judged to be disturbing or likely to disturb the examination. The Chief Invigilator shall report any such action taken to the Dean through the Faculty Examination Coordinator immediately after the completion of the examination by other candidates.\nAny candidate suspected of any examination irregularity shall be required to sign and submit to Chief Invigilator a written statement in the Examination hall. Failure to make a written statement shall be regarded as an admission of the charge against such a candidate.\nThe Dean shall, within 48 hours of receiving a report, set up a panel of not less than three academic staff to investigate the alleged examination misconduct. The report of such investigation shall be made available within two weeks through the Deputy Registrar (Academic) to the Registrar who shall on the basis of the recommendations), determine whether or not the matter should receive the attention of the Students' Disciplinary Committee.\nThe Students' Disciplinary Committee shall, within two weeks of receiving such a report, investigate and recommend the penalty in cases of proven misconduct to the Vice-Chancellor in accordance with Section 17 of the University Act.\nPenalty\nAny student found guilty of the offences contained under section 16 (B) (xiii) - a-h and section (C) (a) - (k) shall be expelled from the University.\n(D) Examination Code of Conduct, Offences and Penalty\nWhere the Dean has reason to believe that the nature of any question or the content of any question paper may have become known before the date and time of the examination to any person(s) other than the examiners and any official of the University authorized to handle the examination question paper, he may order the suspension of the examination or cancellation of the question paper or the setting of a new paper. He shall then investigate the leakage and report the matter to the Vice-Chancellor.\n(E) Absence from Examination\nCandidates shall present themselves at such University Examinations for which they have registered under these Regulations. Candidates who fail to do so for reasons other than proven ill-health, accident or any emergencies shall be deemed to have failed the particular examination. Misreading of the time-table and such other excuses. shall not be accepted as a satisfactory explanation for absence.\nA student who falls ill during examination period should report in writing to the Dean of his/her faculty through his/her Head of Department.\n(F) Make-Up Examinations\nA student who is absent from an examination on account of ill-health confirmed by medical evidence from the Director of University Health Services, may be given a make-up examination in the course(s) missed: otherwise, he/she shall repeat the course concerned if he/she so desires but subject to the status of the course.\nApproval for make-up examination shall be by Faculty Board indicating that:\nthe ill-health has been reported to the Dean through the Head of Department and\nthe candidate has obtained a written report from the Director of Health Services or his designated officer which either:\nis dated prior to the end of the examination, or\nprovides evidence that the student was hospitalized during the period of examination.\nA \"Make-Up\" Examination is an examination specially arranged for a student or group of students who could not sit for the normal examinations due to ill-health or any other unavoidable circumstances. Each case will however, be treated on its merit.\n"
    },
    {
      "title": "MATRICULATION OATH",
      "subtitle": "The pledge students make to the university",
      "content": "On admission to membership of the University of Ilorin, I hereby declare that:\nI have not previously matriculated in this University;\nI will pay due respect and obedience to the authorities of the University of Ilorin and I will faithfully observe all regulations which may, from time to time; be issued by them for the good administration of the University, including directive that students should make a restitution for any damage done by students to property of the University or of members of the public/whether in the course of protest or otherwise;\nI am not a secret cult member;\nI will not either alone, or in conjunction with other students, engage in any acts of violence, or other improper conduct, or in acts calculated to damage the property of the University; or of the community;\nDuring the period of my stay in this University, I shall not belong to any secret cult and shall not in any way aid or abet cultism or fail to disclose to the authorities of this University, or the police, the identity of cultists) I shall become aware of, or the activities of cultist which shall, thereafter, come to my knowledge;\nI will not participate in any activity of, or belong to any student organization, whether on campus or not, unless I have evidence that the organizations) is duly registered with the University as at the time of the activity or membership.\nI have not registered for, neither will I register for, or undertake any other course of study either on full-time or part-time basis in this or any other Institution during the period of my studentship in this University.\nIn case of any breach of any of the clauses of this Oath, the Vice-Chancellor has the sole prerogative to summarily expel me from the University;\nMy parents/Guardians have guaranteed my resolve to abide by this declaration which is made bonafide; and\nI make this Oath truthfully, and in accordance with the Oaths Act.\nDRESS CODE\n"
    },
    {
      "title": "DRESS CODE",
      "subtitle": "Rules for proper student dressing",
      "content": "The University is determined to continue to impact positively on its students not only intellectually, but also morally in pursuit of its avowed commitment to the TOTAL MAN. To this end, it will award its degree to only deserving students who have been found worthy not only in learning but also in character. Students are therefore strongly advised to exhibit good behaviour and dress decently at all times.\nThe mode of dressing of a student speaks volume about him or her. In other words, one’s appearance influences people’s perception of one’s person. Students should, therefore, always dress responsibly to command respect. All students must refrain from wearing INDECENT CLOTHINGS, if they must be accorded respect and protect their dignity.\nYou are hereby required to note that the following constitute inappropriate mode of dressing that will not be tolerated in the University environment (including Lecture Theatres, Libraries, Classrooms, Laboratories, Examination Venues, Seminar Rooms, Faculties, Departments, Administrative Buildings, Car Parks and Vehicles among others):\nDress that expose any sensitive parts of the body (cleavage, chest, back, navel, thigh and armpit): Examples include Topless, Knickers, Backless, Off-shoulders, Mini-skirts (anything above the knee), Dress and Skirt with slit above the knees, Mono strap II, Bum shorts, and clothes that reveals the armpits when hands are raised.\nTight fitting wears that shows the curves: Fitted clothes made to follow the shape of the body like Body Hugs, Front Bottom Dress (Unequal) etc.\nObscene/Transparent/See-through Wears: that expose the inner body, showing complexion and all the vital endowment of the individual.\nT-shirts with Obscene Inscriptions depicting immorality, hooliganism, cultism: Any T-shirts, clothes that sends sexy/stimulating/seductive messages, displaying messages of hooliganism/cultism.\nIndelible Markings and Body Tattoos.\nPencil Trousers/Leggings/Jogging Trousers with short tops: must be worn alone, but covered completely with long tops.\nShort and Skimpy dresses: includes Indomie/Hand Spaghetti, Camisole only, Body Hugs, Topless blouse, Show-me-your chest, Tops above the navels, Sleeveless Dress and Hips and Knickers.\nTattered/Ripped Jeans: Jeans with holes, tight jeans that shows curves must be worn with long clothes that cover the curves/body. Dirty jeans/jeans with obscene subliminal messages\nKnickers: Knickers of whatever kind is not allow, this rule extend to performing arts/sport students (it is restricted to the sport arena and theatre rooms/hall).\nBathroom slipper/Crocs/Party shoes: Not acceptable within the administrative and academic areas. Noisy heeled shoes are not allowed.\nMake-ups: Heavy make-up, High heels, Eye lashes etc.\nSaggy Trousers: Any trousers worn below the waist level, “saggy”, “yansh”, “ass level”, “baggy”, trousers without belt. And any other form of indecent trousers.\nWearing of ear rings by male students\nWearing of more than one ear rings by female students\nRumpled and dirty clothes\nSkin/ear piercing: Piercing of any form by male is prohibited. Acceptable piercing for females is one pierce for each earlobe. Any other piercing of body parts is prohibited.\nHairstyles: Bushy, ‘Old School’, Dread, Galax, Fadeout (coloured) and Rough coil haircuts, Unkempt appearances\nHair plaiting or weaving by male students/long braid, weave-on/extension by females: Plaiting or weaving for male is not allowed. No hair extension (length and bogus) by braiding, fixing, weave-on or wigs. The length should not go beyond the scapular.\nUnderclothing, such as singlet worn publicly.\nShirts that reveal the wearer’s chest unduly.\nWearing of loose ties and unbuttoned shirts.\nWearing of leg chain.\n"
    }
  ]
}
